In [2]:
import pandas as pd

df = pd.read_csv('ddi13-warmups/src/data/titanic_survival.csv')

In [3]:
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [18]:
first, second, third = df.groupby('class').mean(numeric_only=True)['survived']

In [13]:
fem_num, male_num = df['sex'].value_counts().iloc[:]

In [9]:
df['child'] = df['age'] < 18

In [14]:
child_num = df['child'].count()

In [ ]:
totals = {'first_class': first, 'second_class': second, 'third_class:' third, 'female': fem_num, 'male': male_num, 'child': child_num}
print(totals)